lyp256/jinjian-battery-soc-module/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_GATTC_ENABLE=y
# CONFIG_BT_GATTS_ENABLE is not set
# CONFIG_BT_BLE_SMP_ENABLE is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_42_SCAN_EN=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_JINJIAN_LOG_LEVEL_DEFAULT=3
CONFIG_JINJIAN_MAX_LOG_STREAMS=1
CONFIG_JINJIAN_LED_ENABLE_DEFAULT=y
CONFIG_JINJIAN_PWR_LED_GPIO=-1
CONFIG_JINJIAN_PWR_LED_ACTIVE_LOW=n
CONFIG_JINJIAN_STATUS_LED_GPIO=15
CONFIG_JINJIAN_STATUS_LED_ACTIVE_LOW=n
CONFIG_JINJIAN_WS2812_GPIO=8
CONFIG_JINJIAN_WS2812_LED_COUNT=1
CONFIG_JINJIAN_FACTORY_RESET_GPIO=9
CONFIG_JINJIAN_FACTORY_RESET_ACTIVE_LOW=y
CONFIG_JINJIAN_FACTORY_RESET_HOLD_MS=3000
